:PROPERTIES:
:ID:       954a6d1b-03c7-4533-b541-95240bc569f3
:END:
#+title: hisab
#+setupfile: ../org-html-themes/comfy_inline.theme

** 

#+NAME: gifts
| boys    | name of gift | amount |
|---------+--------------+--------|
| Vipul   | bag          |    200 |
| Vipul   | perfume      |    660 |
| Vipul   | Roses        |    100 |
| Vipul   | Jhumka       |    480 |
| Bhushan | Chocolate    |    314 |
|---------+--------------+--------|
| sum     |              |   1754 |
#+TBLFM: @>$3=vsum(@2$3..@-1$3)

|                 |    A | to be returned to vipul and bhushan and paid by other to them=(A-SUM) |
|-----------------+------+-----------------------------------------------------------------------|
| paid by Vipul   | 1440 |                                                                  1220 |
| paid by bhushan |  314 |                                                                    94 |
| sum             |      |                                                                  1314 |
#+TBLFM: @>$3=vsum(@2$3..@3$3)

| name      | contri =(A-Sum)/7, 7 is remaining people who are yet to do payment |
|-----------+--------------------------------------------------------------------|
| Vipul     |                      to be returned amount divided among 7 people. |
| Harshal   |                                                                220 |
| Omkar     |                                                                220 |
| Bhavin    |                                                                220 |
| Dinesh    |                                                                220 |
| Mahesh    |                                                                220 |
| Rohit     |                                                                220 |
| Rushikesh |                                                                220 |
| bhushan   |                          to be returned amount is 94, someone pays |
|           |                                                                    |
#+TBLFM: @2$3..@-1$2=220

